In [19]:
# We are woking on project --> Bengaluru_House_Data
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px
from sklearn.preprocessing import LabelEncoder
import warnings

warnings.filterwarnings("ignore")

In [20]:
df = pd.read_csv("trainn.csv")
df.head(3)

,Unnamed: 0,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,24238194,2015-05-07 19:52:06.0000003,7.5,2015-05-07 19:52:06 UTC,-73.999817,40.738354,-73.999512,40.723217,1
1,27835199,2009-07-17 20:04:56.0000002,7.7,2009-07-17 20:04:56 UTC,-73.994355,40.728225,-73.994710,40.750325,1
2,44984355,2009-08-24 21:45:00.00000061,12.9,2009-08-24 21:45:00 UTC,-74.005043,40.740770,-73.962565,40.772647,1

In [21]:
df.columns

Index(['Unnamed: 0', 'key', 'fare_amount', 'pickup_datetime',
       'pickup_longitude', 'pickup_latitude', 'dropoff_longitude',
       'dropoff_latitude', 'passenger_count'],
      dtype='object')

In [22]:
df.isnull().sum()

Unnamed: 0           0
key                  0
fare_amount          0
pickup_datetime      0
pickup_longitude     0
pickup_latitude      0
dropoff_longitude    1
dropoff_latitude     1
passenger_count      0
dtype: int64

In [23]:
df.dropna()

,Unnamed: 0,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,24238194,2015-05-07 19:52:06.0000003,7.5,2015-05-07 19:52:06 UTC,-73.999817,40.738354,-73.999512,40.723217,1
1,27835199,2009-07-17 20:04:56.0000002,7.7,2009-07-17 20:04:56 UTC,-73.994355,40.728225,-73.994710,40.750325,1
2,44984355,2009-08-24 21:45:00.00000061,12.9,2009-08-24 21:45:00 UTC,-74.005043,40.740770,-73.962565,40.772647,1
3,25894730,2009-06-26 08:22:21.0000001,5.3,2009-06-26 08:22:21 UTC,-73.976124,40.790844,-73.965316,40.803349,3
4,17610152,2014-08-28 17:47:00.000000188,16.0,2014-08-28 17:47:00 UTC,-73.925023,40.744085,-73.973082,40.761247,5
...,...,...,...,...,...,...,...,...,...
199995,42598914,2012-10-28 10:49:00.00000053,3.0,2012-10-28 10:49:00 UTC,-73.987042,40.739367,-73.986525,40.740297,1
199996,16382965,2014-03-14 01:09:00.0000008,7.5,2014-03-14 01:09:00 UTC,-73.984722,40.736837,-74.006672,40.739620,1
199997,27804658,2009-06-29 00:42:00.00000078,30.9,2009-06-29 00:42:00 UTC,-73.986017,40.756487,-73.858957,40.692588,2
199998,20259894,2015-05-20 14:56:25.0000004,14.5,2015-05-20 14:56:25 UTC,-73.997124,40.725452,-73.983215,40.695415,1
199999,11951496,2010-05-15 04:08:00.00000076,14.1,2010-05-15 04:08:00 UTC,-73.984395,40.720077,-73.985508,40.768793,1

In [24]:
df["Journey_day"] = pd.to_datetime(df['key']).dt.day

In [25]:
df['Journey_month'] = pd.to_datetime(df['key']).dt.month

In [26]:
df['Journey_hour'] = pd.to_datetime(df['key']).dt.hour

In [27]:
df['Journey_year'] = pd.to_datetime(df['key']).dt.year

In [28]:
df['Journey_weekday'] = pd.to_datetime(df['key']).dt.day_name()

In [29]:
df['Journey_minute'] = pd.to_datetime(df['key']).dt.minute

In [30]:
df.head(3)

,Unnamed: 0,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,Journey_day,Journey_month,Journey_hour,Journey_year,Journey_weekday,Journey_minute
0,24238194,2015-05-07 19:52:06.0000003,7.5,2015-05-07 19:52:06 UTC,-73.999817,40.738354,-73.999512,40.723217,1,7,5,19,2015,Thursday,52
1,27835199,2009-07-17 20:04:56.0000002,7.7,2009-07-17 20:04:56 UTC,-73.994355,40.728225,-73.994710,40.750325,1,17,7,20,2009,Friday,4
2,44984355,2009-08-24 21:45:00.00000061,12.9,2009-08-24 21:45:00 UTC,-74.005043,40.740770,-73.962565,40.772647,1,24,8,21,2009,Monday,45

In [31]:
df1 = df[["fare_amount", "passenger_count", "Journey_day", "Journey_month", "Journey_hour", "Journey_year", "Journey_weekday", "Journey_minute"]]

In [32]:
df1.head(3)

,fare_amount,passenger_count,Journey_day,Journey_month,Journey_hour,Journey_year,Journey_weekday,Journey_minute
0,7.5,1,7,5,19,2015,Thursday,52
1,7.7,1,17,7,20,2009,Friday,4
2,12.9,1,24,8,21,2009,Monday,45

In [33]:
df1['Journey_weekday'] = df1["Journey_weekday"].replace({"Sunday": 0, "Monday": 1, "Tuesday":2, "Wednesday":3, "Thursday":4, "Friday":5, "Saturday":6})

In [34]:
from scipy.stats import zscore
z = np.abs(zscore(df1))
df2 = df1[(z<3).all(axis=1)]

In [35]:
df1.shape

(200000, 8)

In [36]:
df2.shape

(190417, 8)

In [37]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   fare_amount      200000 non-null  float64
 1   passenger_count  200000 non-null  int64
 2   Journey_day      200000 non-null  int32
 3   Journey_month    200000 non-null  int32
 4   Journey_hour     200000 non-null  int32
 5   Journey_year     200000 non-null  int32
 6   Journey_weekday  200000 non-null  int64
 7   Journey_minute   200000 non-null  int32
dtypes: float64(1), int32(5), int64(2)
memory usage: 8.4 MB